In [1]:
'''numpy>차원이 다양한 대신 내부 데이터 타입은 같다고 가정, Pandas>차원이 2차원(table), 내부 데이터 타입은 다양 
2차원 테이블> 열:데이터 타입에 대한 설명 행:각 값을 구분
다음과 같이 import해서 쓴다.
'''
import pandas as pd

#Series: 인덱스(index)가 있는 1차원 배열
s = pd.Series([1, 3, 5, 7, 9])
print(s)
print(s[2]) #indexing >앞의 값, 인덱스 자동 생성

# dictionary를 이용해 만들기
dic = {'a':1, 'b':3, 'c':5}
s = pd.Series(dic)
print(s)
print(s['b']) #indexing

#dic이랑 series가 비슷함

#딕셔너리와 다른 점: 순서가 있다!
s = pd.Series([1,3,5,7,9], index=['LGT','DOO','HWE','LOT','SKW'])
#print(s)
#print(s['LOT'])
print(s[:'LOT']) # 슬라이싱에서 어디까지 나오는지 주목

# 시리즈를 딕셔너리로 변환
d = s.to_dict()
print(type(d), d)

0    1
1    3
2    5
3    7
4    9
dtype: int64
5
a    1
b    3
c    5
dtype: int64
3
LGT    1
DOO    3
HWE    5
LOT    7
dtype: int64
<class 'dict'> {'LGT': 1, 'DOO': 3, 'HWE': 5, 'LOT': 7, 'SKW': 9}

In [ ]:
'''데이터 프레임은 우리에게 친숙한 2차원 표와 같은 형태로 생각하면 된다.
행(row)과 열(column)으로 이루어져 있으며, 각 열에는 name이 있고 행에는 index가 있다.'''

score={'학번':[201700013,201600023,201600033],
       '이름':['변사또','이몽룡','성춘향'],
       '퀴즈':[15,20,10],
       '중간고사':[20,20,15]}

score_df= pd.DataFrame(score) #여러 개의 dic을 data frame으로 바꿈 
score_df

#행>index 열>col name // series로 뜯으면 행>index가 index // col>colname이 index 

print(type(score_df['학번'])) #colname을 키로 받음
score_df['학번'] #series로 뜯어온 거
#score_df[['학번']] #data frame으로 뜯어온 거
#>> 타입이 다름 print(type(score_df[['학번']]))

#score_df[0] #key 오류 / colname이 default 
#score_df[['학번','Quiz']] 여러값을 원하면 리스트에 넣고 요청해야함

In [ ]:
'''행 추가하기
loc를 이용해서 추가가 가능
단 행의 인덱스가 0부터 시작해서 순차적으로 더해진 경우에 아래와 같이 할 수 있음 append 지원안함 comcat'''
print(len(score_df))
score_df.loc[len(score_df)] = [201700002, '이몽룡', 17, 17]
score_df

In [27]:
df = pd.read_csv('RegularSeasonCompactResults.csv') #옵션이 여러 개

In [23]:
df.head() #앞에 5개 (x) x원하는 갯수

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0
4    1985      25     1192      86     1447      74    H      0
5    1985      25     1218      79     1337      78    H      0
6    1985      25     1228      64     1226      44    N      0
7    1985      25     1242      58     1268      56    N      0
8    1985      25     1260      98     1133      80    H      0
9    1985      25     1305      97     1424      89    H      0

In [17]:
df.tail() #뒤에 5개

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
161547    2019     132     1153      69     1222      57    N      0
161548    2019     132     1209      73     1426      64    N      0
161549    2019     132     1277      65     1276      60    N      0
161550    2019     132     1387      55     1382      53    N      0
161551    2019     132     1463      97     1217      85    H      0

In [21]:
df.shape #행,열 수
df.columns #pandas에서 관리하는 인덱스들의 리스트 index에 담겨 있음 
df.columns.tolist() #index를 벗긴 리스트

(161552, 8)

In [25]:
df.describe() #통계
#aggregation Numpy > 전체에서 값 1개 Pandas > col별로 1개씩

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,NumOT
count,161552.000000,161552.000000,161552.000000,161552.000000,161552.000000,161552.000000,161552.000000
mean,2003.228731,74.665359,1286.919004,76.795125,1282.637498,64.692526,0.045137
std,10.058660,33.670352,104.521630,12.066260,104.742961,11.349610,0.249751
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1995.000000,47.000000,1198.000000,69.000000,1191.000000,57.000000,0.000000
50%,2004.000000,77.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2012.000000,103.000000,1380.000000,84.000000,1375.000000,72.000000,0.000000
max,2019.000000,132.000000,1466.000000,186.000000,1466.000000,150.000000,6.000000

In [31]:
df.max() #최대값
df['WScore'].max() #특정 열의 최대 값

64.69252624541943

In [ ]:
df['LScore'].mean() #특정 열의 평균 값

In [127]:
df['WScore'].argmax() #특정 열의 최대인 행의 위치(index)
#향후에는 argmax 대신 idxmax를 쓰도록 친절하게 권장하므로 이후부터는 idxmax로 고쳐서 쓴다.

24970

In [33]:
df.loc[24970] #행에 대한 인덱싱

Season     1991
DayNum       68
WTeamID    1258
WScore      186
LTeamID    1109
LScore      140
WLoc          H
NumOT         0
Name: 24970, dtype: object

In [35]:
df['WLoc'].value_counts() #특정 열에 사용된 값 횟수

WLoc
H    95878
A    49260
N    16414
Name: count, dtype: int64

In [ ]:
df.info() #col별 정보

In [ ]:
Wscore = df['Wscore'] #열을 기준으로 인덱싱을 하면 특정 열의 값만을 추출
Wscore.head() #갯수가 너무 많으므로 뒤에 head()함수를 써서 앞부분만 추출

In [37]:
df['WScore'].idxmax()
#argmax(),iloc vs idxmax(),loc 
#position(location) vs index
#arg VS idx https://stackoverflow.com/questions/47596390/can-i-use-idxmax-instead-of-argmax-in-all-cases
#iloc vs loc https://stackoverflow.com/questions/31593201/how-are-iloc-and-loc-different

24970

In [135]:
biggest=df['WScore'].idxmax() #가장 큰 값 집어넣기

In [133]:
df.loc[df['WScore'].idxmax()] #loc안에 idxmax집어 넣기

Season     1991
DayNum       68
WTeamID    1258
WScore      186
LTeamID    1109
LScore      140
WLoc          H
NumOT         0
Name: 24970, dtype: object

In [9]:
a = {
    'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa'],
   'Age':[26,27,25,34,31,27,25,33,42,32,51,47],
   'Score':[89,87,67,55,55,72,76,79,44,92,89,69]}
 
af = pd.DataFrame(a)
af

af=af.reindex([1,4,6,2,3,5,9,8,0,7,11,10]) #인덱스 재정렬 (명시적 인덱스)
af
#Pandas에는 순차 인덱스를 제공함 
af.loc[:6] #6개가 아니라 3개만 나옴 또한 6인 애가 포함이 됨 ,문자열 index 사용가능

       Name  Age  Score
1     Bobby   27     87
4     Rocky   31     55
6  Jaqluine   25     76

In [11]:
af

         Name  Age  Score
1       Bobby   27     87
4       Rocky   31     55
6    Jaqluine   25     76
2    Cathrine   25     67
3     Madonna   34     55
5   Sebastian   27     72
9      Andrew   32     92
8       David   42     44
0       Alisa   26     89
7       Rahul   33     79
11     Teresa   47     69
10       Ajay   51     89

In [111]:
af.iloc[:6] #6개 ,문자열 index 사용 불가 , np와 같음

        Name  Age  Score
1      Bobby   27     87
4      Rocky   31     55
6   Jaqluine   25     76
2   Cathrine   25     67
3    Madonna   34     55
5  Sebastian   27     72

In [113]:
af2=af.sort_index(ascending=False) #내림차순 ==reserve=True
af2.iloc[3:5, 0:1] #행 렬 다 추출 가능 , 숫자 사용

    Name
8  David
7  Rahul

In [119]:
af2.loc[11:7,['Name','Age']] #행 렬 다 추출 가능 , index 사용 
af2.loc[11:7,'Name':'Score'] #slicing 사용가능

      Name  Age  Score
11  Teresa   47     69
10    Ajay   51     89
9   Andrew   32     92
8    David   42     44
7    Rahul   33     79

In [23]:
af.iloc[af['Score'].argmax()]

Name     Andrew
Age          32
Score        92
Name: 9, dtype: object

In [121]:
af2.loc[af2['Score'].idxmax()]

Name     Andrew
Age          32
Score        92
Name: 9, dtype: object

In [101]:
df.loc[[df['WScore'].idxmax()]]['LScore'] #이긴 팀의 점수가 가장 높은 경기에서 진 팀의 점수만 가져오고 싶다면 아래와 같이 쓴다.

24970    140
Name: LScore, dtype: int64

In [99]:
df.loc[[df['LScore'].idxmin()]]['WScore']

100027    49
Name: WScore, dtype: int64

In [97]:
df.loc[df['LScore'].idxmin()]['WScore']

49

In [ ]:
#df[df['LScore'] == df['LSocre'].min()]

In [123]:
df.loc[df['WScore'].idxmax(), 'LScore']

140

In [29]:
df.iloc[df['WScore'].argmax(), 5]

140

In [117]:
df.sort_values('LScore').head() #내부에 기준값
#값 저장 > 원본에 변경값 집어넣기 df= ~~~ or df.sort_values('LScore', inplace=True)

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
100027    2008      66     1203      49     1387      20    H      0
49310     1997      66     1157      61     1204      21    H      0
89021     2006      44     1284      41     1343      21    A      0
85042     2005      66     1131      73     1216      22    H      0
103660    2009      26     1326      59     1359      22    H      0

In [ ]:
df[df['WScore'] > 150].head() # Boolean Series를 이용해 조건이 True인 행들만 추출